Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F37B.tmx
Source language: en_us
Languages: zh_cn

source: What the royals eat at home
zh_cn: 英国皇室饮食探秘

source: The Queen likes cereal kept in Tupperware and her guests to be piped in to dinner.
zh_cn: 女王喜欢特百惠包装的麦片，还喜欢让乐队吹奏管乐器迎宾客入宴。

source: Rachel Cooke lifts the lid on the royals' appetites and their love of all things eggy
zh_cn: 雷切尔库克向世人曝露了皇室的饮食爱好以及他们对蛋类食物的钟爱。

source: Queen Elizabeth II smiles as she opens the refurbished East Wing of Somerset House
zh_cn: 女王伊丽莎白二世在打开翻修好的萨默赛特宫东翼大门时，脸上露出了笑容。

source: In 2006, a story appeared in the newspapers, courtesy of Jeremy Paxman, who had been staying at Sandringham while researching his latest book, On Royalty.
zh_cn: 2006年，报纸上登过一个故事，这个故事是从杰里米·帕克斯曼那里得知的，他在为其新书《关于皇室》搜集资料时，一直居住在桑德林汉姆宫中。

source: The gist of it was that the Prince of Wales was so fussy about his soft-boiled eggs that his staff would prepare up to seven for him every morning in the hope that at least one would be done to perfection.
zh_cn: 该书主要讲威尔士亲王对半生不熟的鸡蛋过于挑剔，以致于厨师们每天早晨要一共准备7个蛋，就是为了至少其中一个能让王子满意。

source: When I first heard this, I clapped my hands together in glee.
zh_cn: 第一次听说这个故事时，我暗自鼓掌发笑。

source: It seemed so perfect, so of a piece with what one already believed of Charles (unable even to put his own toothpaste on his toothbrush).
zh_cn: 这个故事编得太完美了，之前关于查尔斯王子，也有一个已被信以为真的故事（说他连牙膏都挤不到牙刷上）。

source: Soon after, though, there came - boo! - a rebuttal.
zh_cn: 不过，没过多久，就有人——嘘！——出言辩驳了呢。

source: No, said a spokesman for Clarence House.
zh_cn: 不是这样的，克拉伦斯宫的发言人反驳道。

source: Paxman's anecdote was "totally untrue".
zh_cn: 帕克斯曼所讲的逸闻趣事“纯属无中生有”。

source: The Prince of Wales would eat his egg irrespective of whether or not its yolk was sufficiently runny.
zh_cn: 威尔士亲王吃鸡蛋时，可不在乎蛋黄是不是纯液态状。

source: As denials go, this one was swift, and absolute.
zh_cn: 所有的辩驳言论中，这是传播最为迅速、也是绝对属实的。

source: But it was also, to my mind, a failure.
zh_cn: 可依我看来，这样的论断并不成立。

source: For one thing, it implicitly suggested that Charles thought himself quite the hero for ploughing manfully through a hard, dry egg. For another, more egg stories soon followed in its wake.
zh_cn: 其一是因为，它含蓄暗示了查尔斯王子自以为是个英雄，能够果断地剥去鸡蛋干硬的外壳儿；其二，在该故事的影响下，更多关于鸡蛋的传闻纷至沓来。

source: Two years later, Mervyn Wycherley, Charles's private chef during his first marriage, revealed that the prince's security detail would inform the kitchen as soon as HRH was on his way home for tea.
zh_cn: 两年后，一个叫默文·威彻利的人出来爆料，王子殿下一踏上回宫喝茶的路，保安特勤队便会告知厨房，此人曾在查尔斯王子第一次婚姻期间任殿下的私人主厨。

source: "His eggs had to be boiled for exactly four minutes," said Wycherley. "It was never anything other than a four-minute egg.
zh_cn: “殿下的鸡蛋只煮4分钟，不多不少，”威彻利还说，“特勤队的通知内容从来都是关于一个要煮四分钟的鸡蛋，别无他事。

source: His detectives radioed his ETA ahead.
zh_cn: 殿下回到皇宫的时间会由他的侦探会提前通过广播告知。

source: I always kept three pans boiling - just to be safe."
zh_cn: 我总是同时烧上三口锅子，以备不测。”

source: What is it with the royal family and eggs?
zh_cn: 皇室与鸡蛋之间到底发生了什么呢？

source: If we are to believe Charles Oliver, a servant who worked at Buckingham Palace under Victoria, George VI and Queen Elizabeth II, and whose "lost" diaries were eventually used, in 2003, as the basis for a rather odd book called Dinner at Buckingham Palace, the royals have a "passion" for them.
zh_cn: 查尔斯·奥立弗曾在维多丽亚女王、乔治六世和伊丽莎白二世时期效力于白金汉宫，据说他有许多“遗失”的日记，但最终又在2003年作为参考，用于创作一本相当怪异的书，这本书叫作《白金汉宫的晚餐》，如果我们相信查尔斯，就知道皇室为何“酷爱”鸡蛋了。

source: Like the rest of us, they like them scrambled, fried, boiled and poached, but they also enjoy them en cocotte a la creme (baked with cream, a treat they like to accompany with minced chicken); plat chasseur (garnished with chicken livers and a sauce of white wine, consomme and herbs); and farcis ¨¤ la Chimay (stuffed with mushrooms and coated with Mornay sauce).
zh_cn: 和我们一样，他们也喜欢食用炒、煎、煮的鸡蛋，不过，他们还喜欢奶油蛋卷（这道菜是用奶油烘焙而成，他们喜欢配上鸡肉酱食用）；plat chasseur （由鸡肝和一种白葡萄酒沙司、清炖肉汤以及草本植物汁做成）；farcis à la Chimay （用蘑菇做馅儿，并在表层涂上奶油蛋黄酱）。

source: Every day begins with an egg, and they're eaten for tea, too - with crumpets, if you're Prince Charles.
zh_cn: 假如你是查尔斯王子，每天早晨都要先吃鸡蛋，也是为了喝茶——就松脆饼吃。

source: The Queen favours brown eggs, believing that they taste better.
zh_cn: 女王陛下偏爱吃棕壳鸡蛋，她认为这样味道更美。

source: Her great-great grandmother, Queen Victoria, ate her boiled egg, served in a golden egg cup, with a golden spoon.
zh_cn: 而她的高祖母，也就是维多丽亚女王，吃的是煮鸡蛋，要用金蛋杯来盛，用金汤匙来吃。

source: Leaving aside the indelicate fact that constipation must surely be endemic in the royal palaces, this passion for eggs - such an everyday foodstuff and yet one that can be gussied up to a quite epic degree should cook be in possession of a sufficiently old-fashioned recipe book and large quantities of gelatin - pretty much sums up the royal family's attitude to food.
zh_cn: 抛开皇室中特有的便秘症状这一窘迫事实，就权且说说皇室对鸡蛋的偏爱吧！就是这样一种日常食材，如果哪位厨师能有一本够古老的食谱书，再加以大量的鱼胶粉，便可实现在烹饪中花样百出。我们从这种偏爱中可以总结出皇室对食物的态度。

source: The modern royals, by which I mean Victoria onwards, have often managed to combine an unbounded extravagance with a certain ersatz asceticism.
zh_cn: 现代皇室，我指的事维多丽亚时代以后，常常能做到把无尽的奢华和某种刻意的苦行生活结合在一起。

source: Queen Victoria, who was convinced that "things taste better in smaller houses", favoured plain food, a fact that set her against the fashion of the day, when French cuisine was all the rage (she had a French chef herself, in the form of Charles Elme Francatelli, until he hit a maid and was dismissed).
zh_cn: 维多丽亚女王确信“平民的东西更好吃”，她喜欢清淡的便餐。这种饮食习惯使她完全背离当时法国菜大行其道的饮食风尚（她有一名私人法国厨师，就是大名鼎鼎的查尔斯·艾美·弗兰克特里，后来他因殴打一位女仆而被解雇）。

source: At home, she favoured pies and invalid soups - pearl barley or potato - washed down with her favourite drink, a mixture of claret and whisky.
zh_cn: 居家的女王喜爱馅饼和一种不再被食用的汤食——薏米或者土豆——与她最喜欢的波尔多红葡萄酒和威士忌混合饮品一同享用。

source: On the other hand, when she visited Hatfield House, the home of the Marquess of Salisbury, in 1846, her host felt obliged to spend some ?75,000 (at today's prices) on food and drink for a three-day visit (?800 on turtle soup alone).
zh_cn: 不过另一方面，她在1846年访问索尔兹伯里侯爵的府邸哈特菲尔德庄园时，庄园主人感到有必要花上大约75000英镑为女王的三日之旅准备食品、饮料（单是甲鱼汤就花了800英镑）。

source: She believed, too, in keeping an "imperial" table: one commensurate with her great nation's place in the world.
zh_cn: 女王也认为应当这样安排，以彰显“皇家”餐桌的排场：与其大英帝国在世界上的低位相称。

source: Dinners were elaborate, and, at lunch, curry and rice were always available, served by two Indian servants in elaborate uniforms of blue and gold.
zh_cn: 膳食相当讲究，咖喱饭是中餐必备的，由身穿精致的金蓝相间制服的两名印度仆人呈上。

source: Admittedly, these things do sometimes skip a generation.
zh_cn: 诚然，这些饮食传统有时并不一定为下一代所继承。

source: While he waited to become king, her son, Edward, the Prince of Wales, developed more lavish tastes.
zh_cn: 她的儿子，威尔士亲王爱德华，在继承王位之前，就已经养成了比先前更无节制的饮食习惯。

source: Abstemious he most certainly was not.
zh_cn: 当然，简朴是绝对谈不上了。

source: A cooked breakfast would be accompanied by roast chicken and lobster salad to tide him over until lunch, which would itself consist of eight courses.
zh_cn: 仅是一顿早餐，就要有烧鸡和龙虾色拉，才能帮亲王殿下挨到午餐时分，一顿午餐本就包含八道菜。

source: This was followed by high tea, and then a dinner of 12 courses: two kinds of soup, whole salmons and turbots, vast saddles of mutton and sirloins of beef, not to mention several game birds, some devilled herrings and plenty of cheese.
zh_cn: 之后便是下午茶(一种茶点,常有肉食、糕饼和茶等)，接下来是晚餐，共十二道菜：含两个汤，整条的大马哈鱼、比目鱼，许多羊肉和牛脊肉，更别说各种野禽以及一些蘸了芥末的鲱鱼，同时，席间乳酪供应充足。

source: Finally, before bedtime, he would squeeze in a light supper of cakes and savouries.
zh_cn: 最后在就寝前，王子殿下会再加点夜宵，通常是一些蛋糕以及其他开胃菜肴。

source: Edward, the playboy king, was so greedy that, at the theatre or opera, he would insist on an hour-long interval in order that he might take his supper in the royal box.
zh_cn: 爱德华是一位花花公子型的国王，极为贪吃，至于在剧院或歌剧院时，他常常要求暂停一小时，以便自己能在皇家包厢用晚膳。

source: Six heaving hampers of food - plovers' eggs, cold trout, Parisian pastries - would duly be delivered by the palace.
zh_cn: 皇宫会准时送来满满六大篮的膳食——珩科鸟蛋、冷食鳟鱼、法式点心等等。

source: George V was more modest: before he came to the throne, he lived in the relatively low-key York Cottage, on the Sandringham estate.
zh_cn: 而乔治五世在饮食方面就较为适度了：登基前，他生活在相对比较低调的约克农庄，位于桑德灵厄姆庄园 （女王伊丽莎白二世在英格兰东部诺福克郡的私人宅邸）。

source: It was decorated with new furniture, not old, as if he and his bride, the future Queen Mary, were just an ordinary middle-class couple, and he passed his time mostly in killing animals and tending his stamp collection.
zh_cn: 室内并未保留旧家具，而是配备了新家具，给人的印象就是，仿佛他和他的新娘，也就是未来的玛丽王后，只是一对普通的中产阶级夫妇。他的大部分时间都用来狩猎和集邮了。

source: So when the First World War broke out, four years into his reign, it was perhaps unsurprising that Mary insisted on rationing in the palace - by some accounts even before the public was subjected to it.
zh_cn: 因此，第一次世界大战爆发时，也就是他执政四年的时候，你或许就对玛丽王后坚持在皇宫施行定量配给这一举措并不感到惊讶了——据说，这一举措是先于民众执行的。

source: No one, according to her edict, was to eat more than two courses for breakfast, and the royal chefs were encouraged to create mock cutlets from minced meat.
zh_cn: 根据王后的法令，任何人的早餐不得多于两道菜，同时鼓励御厨把碎肉制成人工肉片。

source: For his part, George prohibited the drinking of wine as long as the war lasted, and was happy to eat thin soup for elevenses, and mashed potato with everything.
zh_cn: 而乔治规定，在战争期间，是禁止饮酒的，上午茶时段，用些清淡汤品，同时将土豆泥配上各色菜品，照样可以让他吃得心满意足。

source: Such deft PR continued with George VI, who also observed rationing during the Second World War.
zh_cn: 乔治六世继承了这样的优良传统，纵然在第二次世界大战期间，也坚持奉行定量供给制度。

source: But George was married to Queen Elizabeth, the Queen Mother - a woman more royal than the royals.
zh_cn: 不过，乔治六世娶的是伊丽莎白王后（伊丽莎白女王的母亲），这位王太后可是一位比当时其它任何皇室成员都尊贵的女人。

source: Last year, a collection of recipes by former staff and guests at the Queen Mother's Scottish house, the Castle of Mey, was published, with a foreword by her ever-devoted grandson, Prince Charles - and just reading it is enough to make the arteries harden.
zh_cn: 去年，皇室出版了一系列食谱，这是由先前在王太后的苏格兰府邸梅伊城堡供职的员工与宾客们整理完成的，并由其最忠诚的皇孙查尔斯王子作序。该食谱单是一读，便足以强化人的动脉系统，更别说如法炮制享用美食了。

source: Elizabeth loved After Eight ice cream (to make quantities for six people you will need two boxes of After Eights and no fewer than six egg yolks), the Souffle Rothschild created by Careme (its essential ingredient is Goldwasser, a strong liqueur containing flakes of gold leaf) and - what did I tell you about eggs? - Oeufs Drumkilbo, a sort of prawn-cocktail-meets-eggs-mayonnaise dish which she liked to serve on picnics.
zh_cn: 伊丽莎白钟爱“八点后”（伦敦巧克力品牌）冰淇淋（要准备六人份的量需要两箱巧克力和至少六只蛋黄）、法国伟大烹调艺术家卡雷梅出品的罗斯柴尔德蛋奶酥（其主要成份是一种含有大量小片金叶状物的烈酒，就是原产于波兰格但斯克的金水酒）——还记得我跟你讲的鸡蛋吗？——爪姆科尔伯蛋Oeufs Drumkilbo，这是一种明虾鸡尾酒混搭鸡蛋蛋黄酱的菜肴，她喜欢在野餐时让人准备这道美食。

source: (Drumbilko is the next estate to Glamis Castle, the Queen Mother's childhood hood; this dish was also served at the wedding of Prince Andrew and Sarah Ferguson in 1986).
zh_cn: （爪姆科尔伯是与格拉密斯堡相邻的一处庄园，女王的母亲就是在那里度过她的童年的。这道菜也曾于1986年在安德鲁王子和萨拉·弗格森的婚宴上被呈上。）

source: And so it continues, the strange coupling of decadence and moderation.
zh_cn: 就这样，这种经济上的衰退与皇室的饮食节制同时存在了，让人难以料想到。
